CSI API ETABS v1

# eTemperature Enumeration

---

The temperature units that can be specified for the model.

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    public enum eTemperature

    Public Enumeration eTemperature

    Dim instance As eTemperature

    public enum class eTemperature

    type eTemperature

Members

| Member name| Value| Description
---|---|---|---
| NotApplicable| 0|
| F| 1|
| C| 2|

Remarks

See Also

#### Reference

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com